#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.template_file.db_init: Reading...
data.cloudflare_ip_ranges.cloudflare: Reading...
data.cloudflare_zone.default: Reading...
data.template_file.db_init: Read complete after 0s [id=28449eb4e9d1fc9645c83cc70ae19461838448a8fb826009599c0d7d13d71fb4]
data.cloudflare_ip_ranges.cloudflare: Read complete after 0s [id=2749251940]
data.cloudflare_zone.default: Read complete after 0s [id=912714793d16044d3fce7b01eedf537f]
cloudflare_page_rule.sitemap_redirect: Refreshing state... [id=70a1eb362a76155e4b03cc26f29111ed]
cloudflare_worker_script.client: Refreshing state... [id=development__client]
cloudflare_worker_route.client: Refreshing state... [id=3b3aba4741ff4e3d8986d03165e46b7b]
aws_s3_bucket.image-storage: Refreshing state... [id=spahi4-photo-images-dev]
aws_security_group.allow_ec2_ssh: Refreshing state... [id=sg-0d594ba603ed3f93e]
aws_db_parameter_group.default: Refreshing state... [id=development-photo-app-db]
data.aws_ami.amazon_linux: Reading...
aws_key_pair.deployer: Refreshing state... [id=deployer-key]
aws_iam_role.ec2_instance: Refreshing state... [id=development__ec2_instance]
aws_default_subnet.default: Refreshing state... [id=subnet-0016e0ee7efc40856]
data.aws_ecr_repository.ecr_repository: Reading...
aws_security_group.allow_ec2: Refreshing state... [id=sg-006744bed4fab9fd4]
aws_security_group.allow_rds: Refreshing state... [id=sg-0f21ef586e4775e51]
aws_s3_bucket.client: Refreshing state... [id=dev.spahi4.me]
aws_iam_role_policy.ecr_policy: Refreshing state... [id=development__ec2_instance:development_ecr_policy]
aws_iam_instance_profile.instance: Refreshing state... [id=development_instance_profile]
data.aws_ami.amazon_linux: Read complete after 1s [id=ami-0a93d84222d393d7b]
data.aws_ecr_repository.ecr_repository: Read complete after 2s [id=spahi4-photo-app]
aws_db_instance.default: Refreshing state... [id=db-CFYWJ2AHSMSBNAUU5UX2PJOFUQ]
null_resource.db_init: Refreshing state... [id=4625364111090141461]
data.template_file.environment: Reading...
aws_iam_policy.image_storage_policy: Refreshing state... [id=arn:aws:iam::851893752920:policy/development_S3UploadPolicy]
data.template_file.environment: Read complete after 0s [id=abc78db8bec7043ec63143cf45ebfc21e7809e8851488f72602533cce903f1ac]
data.template_file.init: Reading...
data.template_file.init: Read complete after 0s [id=9882d5d6d1601063f6f18a250d1f5caf9d0694a573cce8061965ff611d844fa7]
aws_s3_bucket_cors_configuration.image-storage: Refreshing state... [id=spahi4-photo-images-dev]
aws_s3_bucket_public_access_block.image-storage: Refreshing state... [id=spahi4-photo-images-dev]
aws_s3_bucket_versioning.image-storage: Refreshing state... [id=spahi4-photo-images-dev]
aws_s3_bucket_ownership_controls.image-storage: Refreshing state... [id=spahi4-photo-images-dev]
aws_instance.app: Refreshing state... [id=i-0e6b8d2bb95df315f]
aws_iam_policy_attachment.instance_s3_upload_attachment: Refreshing state... [id=development_InstanceS3UploadAttachment]
aws_s3_bucket_website_configuration.client: Refreshing state... [id=dev.spahi4.me]
aws_s3_bucket_public_access_block.client: Refreshing state... [id=dev.spahi4.me]
data.aws_iam_policy_document.s3_bucket_policy_public: Reading...
data.aws_iam_policy_document.s3_bucket_policy_public: Read complete after 0s [id=1039089305]
aws_s3_bucket_policy.client_policy: Refreshing state... [id=dev.spahi4.me]
cloudflare_record.s3_website: Refreshing state... [id=a40e56dd7ab968b88d7fe31a4dcbc5c7]
aws_eip.app: Refreshing state... [id=eipalloc-00a3b92b828b929c6]
cloudflare_record.ecs_api: Refreshing state... [id=d450bf5e093400f58829fc219bf35204]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.app will be updated in-place
  ~ resource "aws_eip" "app" {
        id                   = "eipalloc-00a3b92b828b929c6"
      ~ instance             = "i-0e6b8d2bb95df315f" -> (known after apply)
        tags                 = {}
        # (12 unchanged attributes hidden)
    }

  # aws_instance.app must be replaced
-/+ resource "aws_instance" "app" {
      ~ arn                                  = "arn:aws:ec2:eu-north-1:851893752920:instance/i-0e6b8d2bb95df315f" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "eu-north-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0e6b8d2bb95df315f" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-00d0a672949f4181c" -> (known after apply)
      ~ private_dns                          = "ip-172-31-19-175.eu-north-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.31.19.175" -> (known after apply)
      ~ public_dns                           = "ec2-13-50-118-224.eu-north-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "13.50.118.224" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "allow_ec2",
          - "allow_ec2_ssh",
          - "allow_rds",
        ] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-0016e0ee7efc40856" -> (known after apply)
        tags                                 = {
            "Name" = "photo-app-development"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "688bf375a99a59a27acb76c861147e61a1e46dfd" -> "91621ce66fe2fce37364f1debefcd1e152d27f65" # forces replacement
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0e0b0bdacbd4ca370" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # cloudflare_page_rule.sitemap_redirect will be updated in-place
  ~ resource "cloudflare_page_rule" "sitemap_redirect" {
        id       = "70a1eb362a76155e4b03cc26f29111ed"
      ~ priority = 2 -> 1
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @SPAHI4, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Lint & TS`*